Tekla Open API Reference for Tekla Structures 2025
InputDefinition Constructor
Overload List
Name | Description
DrawingPluginBase.InputDefinition(Identifier, List<Point>)
 Creates a new input definition with multiple points.
DrawingPluginBase.InputDefinition(Identifier, Point)
 Creates a new input definition instance with one point.
DrawingPluginBase.InputDefinition(Identifier, Identifier)
 Creates a new input definition instance with one identifier.
DrawingPluginBase.InputDefinition(Identifier, Point, Point)
 Creates a new input definition instance with two points.
DrawingPluginBase.InputDefinition(Identifier, Point, Point, Point)
 Creates a new input definition instance with three points.
Top
See Also
Reference
DrawingPluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace